// Напишите функцию, которая принимает два числа и возвращает их сумму.

#include <iostream>

int sum(int p1, int p2)
{
    return p1 + p2;
}

int main()
{
    std::cout<<sum(3, 4)<< "\n";
    return 0;
}